firefoamcases/ofFireFoamCase/LES/oppositeBurningPanels/system/panelRegion/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 6;


method          structured;

structuredCoeffs
{
    method      hierarchical;
    patches     (region0_to_panelRegion_fRight_zone region0_to_panelRegion_fLeft_zone);

    hierarchicalCoeffs
    {
         n               (2 3 1);
         delta           0.001;
         order           xyz;
    }
}


hierarchicalCoeffs
{
    n               (1 2 2);
    delta           0.001;
    order           xyz;
}

manualCoeffs
{
    dataFile        "cellDecomposition";
}

metisCoeffs
{
}

// ************************************************************************* //
